xml4test/withIdHashSigCert.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1">   <S:Body>      <ns2:SendRequestRequest xmlns:ns3="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/faults/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">         <ns:SenderProvidedRequestData Id="SIGNED_BY_CONSUMER" xmlns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/1.1" xmlns:ns2="urn://x-artefacts-smev-gov-ru/services/message-exchange/types/basic/1.1">	<ns:MessageID>2362b5d4-7311-11e8-b4b7-7598c2357ddf</ns:MessageID><ns2:MessagePrimaryContent><ns1:BreachRequest xmlns:ns1="urn://x-artefacts-gibdd-gov-ru/breach/root/1.0"  xmlns:ns2="urn://x-artefacts-gibdd-gov-ru/breach/commons/1.0"  xmlns:ns3="urn://x-artefacts-smev-gov-ru/supplementary/commons/1.0.1" Id="PERSONAL_SIGNATURE"> <ns1:RequestedInformation> <ns2:RegPointNum>Т785ЕС57</ns2:RegPointNum> </ns1:RequestedInformation> <ns1:Governance> <ns2:Name>ГИБДД РФ</ns2:Name> <ns2:Code>GIBDD</ns2:Code> <ns2:OfficialPerson> <ns3:FamilyName>Загурский</ns3:FamilyName> <ns3:FirstName>Андрей</ns3:FirstName> <ns3:Patronymic>Петрович</ns3:Patronymic> </ns2:OfficialPerson></ns1:Governance> </ns1:BreachRequest> </ns2:MessagePrimaryContent>	<ns:TestMessage/></ns:SenderProvidedRequestData>         <ns2:CallerInformationSystemSignature><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"><ds:SignedInfo><ds:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr34102001-gostr3411"/><ds:Reference URI="#SIGNED_BY_CONSUMER"><ds:Transforms><ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/><ds:Transform Algorithm="urn://smev-gov-ru/xmldsig/transform"/></ds:Transforms><ds:DigestMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#gostr3411"/><ds:DigestValue>SaNSM39uaWSqCfCUDF07GnE71kc1kOqVWhUHPKSKYNY=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>5y1uvlCykBCRgJYHCF3+RSKGv4Kk2+50xyjZ4cX/Dlf4ve7xjXMQjd6Eb8SwmHJeds3KZyejqt+//Pv35sdTTA==</ds:SignatureValue><ds:KeyInfo><ds:X509Data><ds:X509Certificate>MIIByjCCAXmgAwIBAgIBATAIBgYqhQMCAgMwRzEOMAwGA1UEBhMFQ08uVUsxFTATBgNVBAoTDEluY29ycG9yYXRlZDEPMA0GA1UECxMGUm9sYW5kMQ0wCwYDVQQDEwRS
b290MB4XDTE4MDYxODE2MDMyOFoXDTE5MDYxODAwMDAwMFowUzEOMAwGA1UEBhMFQ08uVUsxFTATBgNVBAoTDEluY29ycG9yYXRlZDEPMA0GA1UECxMGUm9sYW5kMRkwFwYDVQQDExBSb21hbiBQYXN0dXNoa292MGMwHAYGKoUDAgITMBIGByqFAwICIwEG
ByqFAwICHgEDQwAEQBW6W8rh/drrCRoACw0itN46g3Ir5LwKxTM7Df+vljtSjqedW3XedRIiSReZx1VwdIE960mNfSNHOxbSwlKdsOujQjBAMB0GA1UdDgQWBBST6f0nO/W7MAfH34IGkWpd+9cybjAfBgNVHSMEGDAWgBT22UZ3JRJZW4vL0X/+JpzaQNYU
NDAIBgYqhQMCAgMDQQCC2couSAuenFJrdo+ypTPc+QgMoAJJYHbpgPvfdxHMYqi/p18pIolrVnrmA1C2XQ2UhdWGqmoTtlFLpkAL8ZUl</ds:X509Certificate></ds:X509Data></ds:KeyInfo></ds:Signature></ns2:CallerInformationSystemSignature>      </ns2:SendRequestRequest>   </S:Body></S:Envelope>
